Домашняя_работа/src/DataProcessors/ПересчетПоступлений/ПересчетПоступлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПересчетПоступлений</name>
</mdclass:DataProcessor>

Домашняя_работа/src/Documents/ПоступлениеТоваровИУслуг/ПоступлениеТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваровИУслуг</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Домашняя_работа/src/DataProcessors/ПересчетПоступлений/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПересчитатьДокументы(Команда)
	ПересчитатьДокументыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПересчитатьДокументыНаСервере()
	
	Выборка = Документы.ПоступлениеТоваровИУслуг.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		
		Поступление = Выборка.ПолучитьОбъект();
		ДатаПоступления = Поступление.Дата;
		
		Если ДатаПоступления > ДатаНачалаПериода И ДатаПоступления < ДатаЗавершенияПериода Тогда
		
			Для Каждого Строка Из Поступление.Товары Цикл
				Строка.Сумма = Строка.Количество * Строка.Цена;
			КонецЦикла;
			
		КонецЕсли;
		
		Поступление.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
